In [3]:
import pandas as pd

In [7]:
seriesA = pd.Series([1.6, 2.5, 3.6, 4.5])
print(seriesA)

0    1.6
1    2.5
2    3.6
3    4.5
dtype: float64

In [10]:
seriesB = pd.Series(["A", "B", "C", "D"])
print(seriesB)

0    A
1    B
2    C
3    D
dtype: object

In [11]:
data = pd.DataFrame({"Name": seriesB, "Number": seriesA})
print(data)

  Name  Number
0    A     1.6
1    B     2.5
2    C     3.6
3    D     4.5

In [18]:
import pandas as pd

data = {
    "Name": ["Alpha", "Beta", "Gama", "Zeta"],
    "Age": [30, 23, 21, 32],
    "Country": ["India", "US", "Germany", "Australia"]
}

df = pd.DataFrame(data)
print(df)

    Name  Age    Country
0  Alpha   30      India
1   Beta   23         US
2   Gama   21    Germany
3   Zeta   32  Australia

In [25]:
df = pd.DataFrame(data, columns=["Age"])
print(df)

   Age
0   30
1   23
2   21
3   32

In [21]:
df["Age"] = [1,2,3,4]
print(df)

   Age
0    1
1    2
2    3
3    4

In [22]:
name = ["tejas", "ronaldo", "messi", "kohli"]
age = [18, 19, 29, 31]
city = ["adad", "adad", "eref", "adfewf"]

stud = pd.DataFrame({
    "Name": name,
    "Age": age,
    "City": city
})

print(stud)

      Name  Age    City
0    tejas   18    adad
1  ronaldo   19    adad
2    messi   29    eref
3    kohli   31  adfewf

In [26]:
filt = stud[stud["Age"] > 22]
print(filt)

    Name  Age    City
2  messi   29    eref
3  kohli   31  adfewf

In [29]:
import datetime as dt
data = {
    "Name": ["Alpha", "Beta", "Gama", "Zeta"],
    "Age": [30, 23, 21, 32],
    "Major": ["CS", "DS", "Maths", "DS"],
    "GPA": [3.8, 3.2, 3.9, 3.1],
    "enr_date": ["2022-08-15", "2021-09-01", "2023-06-10", "2022-01-20"]
}

samp_data = pd.DataFrame(data)
print(samp_data)

    Name  Age  Major  GPA    enr_date
0  Alpha   30     CS  3.8  2022-08-15
1   Beta   23     DS  3.2  2021-09-01
2   Gama   21  Maths  3.9  2023-06-10
3   Zeta   32     DS  3.1  2022-01-20

In [30]:
samp_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      4 non-null      object
 1   Age       4 non-null      int64
 2   Major     4 non-null      object
 3   GPA       4 non-null      float64
 4   enr_date  4 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 292.0+ bytes

In [31]:
samp_data["enr_date"] = pd.to_datetime(samp_data["enr_date"])
print(samp_data)

    Name  Age  Major  GPA   enr_date
0  Alpha   30     CS  3.8 2022-08-15
1   Beta   23     DS  3.2 2021-09-01
2   Gama   21  Maths  3.9 2023-06-10
3   Zeta   32     DS  3.1 2022-01-20

In [32]:
samp_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      4 non-null      object
 1   Age       4 non-null      int64
 2   Major     4 non-null      object
 3   GPA       4 non-null      float64
 4   enr_date  4 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 292.0+ bytes

In [37]:
onlyDs = samp_data[samp_data['Major'] == "DS"]
onlyDs

   Name  Age Major  GPA   enr_date
1  Beta   23    DS  3.2 2021-09-01
3  Zeta   32    DS  3.1 2022-01-20

In [38]:
onGpa = samp_data[samp_data["GPA"] > 3.5]
onGpa

    Name  Age  Major  GPA   enr_date
0  Alpha   30     CS  3.8 2022-08-15
2   Gama   21  Maths  3.9 2023-06-10

In [43]:
both = samp_data[samp_data["Major"].isin(["CS", "DS"])]
both

    Name  Age Major  GPA   enr_date
0  Alpha   30    CS  3.8 2022-08-15
1   Beta   23    DS  3.2 2021-09-01
3   Zeta   32    DS  3.1 2022-01-20

In [44]:
filt = samp_data[samp_data["GPA"].isna()]
filt

Empty DataFrame
Columns: [Name, Age, Major, GPA, enr_date]
Index: []

In [45]:
da = samp_data[samp_data["enr_date"] > '2023-01-01']
da

   Name  Age  Major  GPA   enr_date
2  Gama   21  Maths  3.9 2023-06-10

In [47]:
da = samp_data[samp_data["Name"].str.contains("a", case=False)]
da

    Name  Age  Major  GPA   enr_date
0  Alpha   30     CS  3.8 2022-08-15
1   Beta   23     DS  3.2 2021-09-01
2   Gama   21  Maths  3.9 2023-06-10
3   Zeta   32     DS  3.1 2022-01-20

In [51]:
samp_data['enr_year'] = samp_data['enr_date'].dt.year
print(samp_data)

    Name  Age  Major  GPA   enr_date  enr_year
0  Alpha   30     CS  3.8 2022-08-15      2022
1   Beta   23     DS  3.2 2021-09-01      2021
2   Gama   21  Maths  3.9 2023-06-10      2023
3   Zeta   32     DS  3.1 2022-01-20      2022

In [58]:
from datetime import datetime

today = datetime.today()
samp_data['enr_today'] = (today - samp_data['enr_date']).dt.days
samp_data

    Name  Age  Major  GPA   enr_date  enr_year  enr_today
0  Alpha   30     CS  3.8 2022-08-15      2022        913
1   Beta   23     DS  3.2 2021-09-01      2021       1261
2   Gama   21  Maths  3.9 2023-06-10      2023        614
3   Zeta   32     DS  3.1 2022-01-20      2022       1120

In [60]:
stud.set_index("Name")

         Age    City
Name
tejas     18    adad
ronaldo   19    adad
messi     29    eref
kohli     31  adfewf

In [65]:
# shallow copy changes with og list

import copy

og_list = [[1,2,3], [4,5,6]]

sh_copy = copy.copy(og_list)

og_list[0][0] = 99
print(og_list)
print(sh_copy)

[[99, 2, 3], [4, 5, 6]]
[[99, 2, 3], [4, 5, 6]]

In [68]:
# deep

import copy

og_list = [[1,2,3], [4,5,6]]

sh_copy = copy.deepcopy(og_list)

og_list[0][0] = 99
print(og_list)
print(sh_copy)

[[99, 2, 3], [4, 5, 6]]
[[1, 2, 3], [4, 5, 6]]

In [70]:
import pandas as pd

class_info = {"Name": ["Tejas", "Messi", "Sui", "Rony"], "Rollno": [21,23,34,11]}

df1 = pd.DataFrame(class_info)
df1

    Name  Rollno
0  Tejas      21
1  Messi      23
2    Sui      34
3   Rony      11

In [72]:
df1["Marks"] = [73,65,73,21]
df1["House"] = ["adad", "adadad", "ereef", "vdvd"]
df1

    Name  Rollno  Marks   House
0  Tejas      21     73    adad
1  Messi      23     65  adadad
2    Sui      34     73   ereef
3   Rony      11     21    vdvd

In [79]:
roll = df1.set_index("Rollno")
roll

         Name  Marks   House
Rollno
21      Tejas     73    adad
23      Messi     65  adadad
34        Sui     73   ereef
11       Rony     21    vdvd

In [94]:
df1.loc[2]
print(df1.loc[2])

Name        Sui
Rollno       34
Marks        73
House     ereef
Name: 2, dtype: object

In [95]:
df1.loc[1:3, : "Name"]

    Name
1  Messi
2    Sui
3   Rony